InformationRegisters/Б24_СМ_НастройкиСмартПроцессов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>Б24_СМ_НастройкиСмартПроцессов</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>СпособСинхронизацииДанных</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>30</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КоличествоПовторенийПриОшибках</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>1</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НеРегистрироватьИзмененияАвтоматически</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПорядокВыполненияСинхронизации</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИдентификаторРегламентногоЗадания</Name>
					<Type>
						<v8:Type>v8:UUID</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИгнорироватьОшибкиВоВремяСинхронизации</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Настройки</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>НастройкаПодключения</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Б24_К_НастройкиПодключения</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

ChartsOfCharacteristicTypes/ДополнительныеРеквизитыИСведения.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<ChartOfCharacteristicTypes>
		<Properties>
			<Name>ДополнительныеРеквизитыИСведения</Name>
			<Type>
				<v8:Type>xs:boolean</v8:Type>
				<v8:Type>cfg:CatalogRef.ЗначенияСвойствОбъектов</v8:Type>
				<v8:Type>xs:string</v8:Type>
				<v8:Type>xs:dateTime</v8:Type>
				<v8:Type>xs:decimal</v8:Type>
				<v8:NumberQualifiers>
					<v8:Digits>17</v8:Digits>
					<v8:FractionDigits>5</v8:FractionDigits>
				</v8:NumberQualifiers>
				<v8:StringQualifiers>
					<v8:Length>1024</v8:Length>
				</v8:StringQualifiers>
				<v8:DateQualifiers>
					<v8:DateFractions>DateTime</v8:DateFractions>
				</v8:DateQualifiers>
			</Type>
			<Hierarchical>false</Hierarchical>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Виден</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидСвойств</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыСвойств</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВладелецДополнительныхЗначений</Name>
					<Type>
						<v8:Type>cfg:ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВыводитьВВидеГиперссылки</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДополнительныеЗначенияИспользуются</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДополнительныеЗначенияСВесом</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Доступен</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Заголовок</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>75</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЗаголовокФормыВыбораЗначения</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЗаголовокФормыВыбораЗначенияЯзык1</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЗаголовокФормыВыбораЗначенияЯзык2</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЗаголовокФормыЗначения</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЗаголовокФормыЗначенияЯзык1</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЗаголовокФормыЗначенияЯзык2</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЗаголовокЯзык1</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>75</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЗаголовокЯзык2</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>75</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЗаполнятьОбязательно</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИдентификаторДляФормул</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Имя</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>МногострочноеПолеВвода</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>2</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НаборСвойств</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Подсказка</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПодсказкаЯзык1</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПодсказкаЯзык2</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ФорматСвойства</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЦветСвойств</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ЦветаСвойств</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЭтоДополнительноеСведение</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ЗависимостиДополнительныхРеквизитов</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ЗависимоеСвойство</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>25</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НаборСвойств</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>10</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Реквизит</Name>
							<Type>
								<v8:Type>cfg:ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</v8:Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>99</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Условие</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>20</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
								<v8:Type>xs:string</v8:Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:TypeSet>cfg:AnyIBRef</v8:TypeSet>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
								<v8:StringQualifiers>
									<v8:Length>50</v8:Length>
								</v8:StringQualifiers>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>Представления</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>КодЯзыка</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>10</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Заголовок</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>75</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Подсказка</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЗаголовокФормыЗначения</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>150</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЗаголовокФормыВыбораЗначения</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>150</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</ChartOfCharacteristicTypes>
</MetaDataObject>

CommonModules/Б24_СМ_ОбщегоНазначенияВызовСервераПовтИсп/Ext/Module.bsl
#Область ПолучениеНастроек

Функция ПолучитьМассивНастроекОВыгружаемыхДанных(ТолькоДляРегистрацииИзменений = Ложь) Экспорт
	
	Результат = Новый Массив;
	
	мНастройкиПодключения = Б24_СМ_ОбщегоНазначенияВызовСервераПовтИсп.ПолучитьМассивНастроекСинхронизации();
	
	Для Каждого НастройкаПодключения Из мНастройкиПодключения Цикл
		
		СтруктураДанных = Новый Структура;
		СтруктураДанных.Вставить("НастройкаПодключения"			, НастройкаПодключения);
		СтруктураДанных.Вставить("СпособСинхронизацииДанных"	, "");
		СтруктураДанных.Вставить("ИнформацияОВыгружаемыхДанных"	, Новый Массив);
		
		НастройкиСинхронизации = Б24_СМ_ОбщегоНазначенияВызовСервераПовтИсп.ПолучитьНастройкуСинхронизацииПоНастройкеПодключения(НастройкаПодключения);
		Если НастройкиСинхронизации.НеРегистрироватьИзмененияАвтоматически И ТолькоДляРегистрацииИзменений Тогда
			Продолжить;
		КонецЕсли;                                                                         
		
		СтруктураДанных.Вставить("СпособСинхронизацииДанных", НастройкиСинхронизации.СпособСинхронизацииДанных);       
		
		СохраненныеНастройки = НастройкиСинхронизации.Настройки.Получить();
		Если СохраненныеНастройки = Неопределено Тогда
			Продолжить;
		КонецЕсли;
		
		Для каждого ТекСтрока Из СохраненныеНастройки Цикл
			
			Если ТекСтрока.Данные = Неопределено Тогда
				Продолжить;
			КонецЕсли;
			
			Если ТекСтрока.Данные.Сущность1С = Неопределено Тогда
				Продолжить;
			КонецЕсли;
			
			Если ТекСтрока.Данные.ВыгружатьНаПортал <> Истина Тогда
				Продолжить;
			КонецЕсли;
			
			ИнформацияОВыгружаемыхДанных = Новый Структура;
			ИнформацияОВыгружаемыхДанных.Вставить("ИдСмартПроцесса"				, ТекСтрока.Ид);
			ИнформацияОВыгружаемыхДанных.Вставить("ТипВладельцаСмартПроцесса"	, ТекСтрока.ТипВладельца);
			ИнформацияОВыгружаемыхДанных.Вставить("Наименование"				, ТекСтрока.Наименование);
			ИнформацияОВыгружаемыхДанных.Вставить("ТипСущности1С"				, ТекСтрока.Данные.ТипСущности1С);
			ИнформацияОВыгружаемыхДанных.Вставить("Сущность1С"					, ?(ТекСтрока.Данные.Сущность1С = Неопределено, "", ТекСтрока.Данные.Сущность1С.Значение));
			ИнформацияОВыгружаемыхДанных.Вставить("ТабличнаяЧасть1С"			, ?(ТекСтрока.Данные.ТабличнаяЧасть1С = Неопределено, "", ТекСтрока.Данные.ТабличнаяЧасть1С.Значение));
			
			СтруктураДанных.ИнформацияОВыгружаемыхДанных.Добавить(ИнформацияОВыгружаемыхДанных);		   
					   
		КонецЦикла;
		
		Результат.Добавить(СтруктураДанных);
		
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции

Функция ПолучитьНастройкиСинхронизации(НастройкаПодключения) Экспорт
	
	СохраненныеНастройки = Б24_СМ_ОбщегоНазначенияВызовСервераПовтИсп.ПолучитьНастройкуСинхронизацииПоНастройкеПодключения(НастройкаПодключения);
	
	Возврат СохраненныеНастройки.Настройки.Получить();
	
КонецФункции

Функция ПолучитьМассивНастроекСинхронизации(КлючНастройки = "", ЗначениеНастройки = "") Экспорт
	
	Запрос = Новый Запрос;
	Если НЕ КлючНастройки = "" Тогда
		Если Тип("Структура") = ТипЗнч(ЗначениеНастройки) Тогда
			Запрос.УстановитьПараметр("ПараметрПоиска", ЗначениеНастройки.НастройкаПодключения);
		Иначе
			Запрос.УстановитьПараметр("ПараметрПоиска", ЗначениеНастройки);
		КонецЕсли;
		
	КонецЕсли;
	
	Запрос.Текст = "ВЫБРАТЬ
	|	Б24_СМ_НастройкиСмартПроцессов.НастройкаПодключения КАК НастройкаПодключения
	|ИЗ
	|	РегистрСведений.Б24_СМ_НастройкиСмартПроцессов КАК Б24_СМ_НастройкиСмартПроцессов
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.Б24_К_НастройкиПодключения КАК Б24_К_НастройкиПодключения
	|		ПО Б24_СМ_НастройкиСмартПроцессов.НастройкаПодключения = Б24_К_НастройкиПодключения.Ссылка
	|ГДЕ
	|	Б24_К_НастройкиПодключения.ПометкаУдаления = ЛОЖЬ";
	
	Если НЕ КлючНастройки = "" Тогда
		Запрос.Текст = Запрос.Текст + "
		|" + " И Б24_СМ_НастройкиСмартПроцессов." + КлючНастройки + " = &ПараметрПоиска";
	КонецЕсли;
	
	Результат = Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("НастройкаПодключения");
	
	Возврат Результат;
	
КонецФункции

Функция ПолучитьНастройкуСинхронизацииПоНастройкеПодключения(НастройкаПодключения) Экспорт
	
	Результат = Новый Структура;
	Результат.Вставить("НастройкаПодключения"					, Справочники.Б24_К_НастройкиПодключения.ПустаяСсылка());
	Результат.Вставить("СпособСинхронизацииДанных"				, "Только ручной режим");
	Результат.Вставить("КоличествоПовторенийПриОшибках"			, 1);
	Результат.Вставить("НеРегистрироватьИзмененияАвтоматически"	, Ложь);
	Результат.Вставить("ПорядокВыполненияСинхронизации"			, "Сперва Битрикс24, затем 1С");
	Результат.Вставить("ИдентификаторРегламентногоЗадания"		, Неопределено);
	Результат.Вставить("ИгнорироватьОшибкиВоВремяСинхронизации"	, Ложь);
	Результат.Вставить("Настройки"								, Новый ХранилищеЗначения(Неопределено));
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("НастройкаПодключения", НастройкаПодключения);
	Запрос.Текст = "ВЫБРАТЬ
	|	Б24_СМ_НастройкиСмартПроцессов.НастройкаПодключения КАК НастройкаПодключения,
	|	Б24_СМ_НастройкиСмартПроцессов.Настройки КАК Настройки,
	|	Б24_СМ_НастройкиСмартПроцессов.СпособСинхронизацииДанных КАК СпособСинхронизацииДанных,
	|	Б24_СМ_НастройкиСмартПроцессов.КоличествоПовторенийПриОшибках КАК КоличествоПовторенийПриОшибках,
	|	Б24_СМ_НастройкиСмартПроцессов.НеРегистрироватьИзмененияАвтоматически КАК НеРегистрироватьИзмененияАвтоматически,
	|	Б24_СМ_НастройкиСмартПроцессов.ПорядокВыполненияСинхронизации КАК ПорядокВыполненияСинхронизации,
	|	Б24_СМ_НастройкиСмартПроцессов.ИдентификаторРегламентногоЗадания КАК ИдентификаторРегламентногоЗадания,
	|	Б24_СМ_НастройкиСмартПроцессов.ИгнорироватьОшибкиВоВремяСинхронизации КАК ИгнорироватьОшибкиВоВремяСинхронизации
	|ИЗ
	|	РегистрСведений.Б24_СМ_НастройкиСмартПроцессов КАК Б24_СМ_НастройкиСмартПроцессов
	|ГДЕ
	|	Б24_СМ_НастройкиСмартПроцессов.НастройкаПодключения = &НастройкаПодключения";
	
	ВыполненныйЗапрос = Запрос.Выполнить();
	
	Если НЕ ВыполненныйЗапрос.Пустой() Тогда
		
		Выборка = ВыполненныйЗапрос.Выбрать();
		
		Пока Выборка.Следующий() Цикл
			
			ЗаполнитьЗначенияСвойств(Результат, Выборка);
			
		КонецЦикла;
		
	КонецЕсли;
	
	Если Результат.Настройки.Получить() = Неопределено Тогда
		Результат.Настройки = Новый ХранилищеЗначения(РегистрыСведений.Б24_СМ_НастройкиСмартПроцессов.ПолучитьНастройкиСинхронизацииПоУмолчанию());	
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции 

#КонецОбласти

Функция СоздатьПолучитьСвойствоДляХраненияЗначенийСвойствБитрикс24() Экспорт
	УстановитьПривилегированныйРежим(Истина);
	
	ТипыДанныхДляОбменаСПорталом = Б24_К_ОбщегоНазначенияВызовСервера.ПолучитьТипыДанныхДляОбменаСПорталом();
	
	НаименованиеСвойства = "Служебное свойство для хранения значений свойств Битрикс24";
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("НаименованиеСвойства", НаименованиеСвойства);
	Запрос.Текст = "ВЫБРАТЬ ПЕРВЫЕ 1
	|	ДополнительныеРеквизитыИСведения.Ссылка КАК Ссылка
	|ИЗ
	|	ПланВидовХарактеристик.ДополнительныеРеквизитыИСведения КАК ДополнительныеРеквизитыИСведения
	|ГДЕ
	|	ДополнительныеРеквизитыИСведения.Заголовок = &НаименованиеСвойства
	|	И ДополнительныеРеквизитыИСведения.ЭтоДополнительноеСведение = ИСТИНА";
	ВыполненныйЗапрос = Запрос.Выполнить();	
	
	Если ВыполненныйЗапрос.Пустой() Тогда
		
		СвойствоОбъект 	= ПланыВидовХарактеристик.ДополнительныеРеквизитыИСведения.СоздатьЭлемент();
		СвойствоОбъект.Комментарий 	= НСтр("ru = 'Создано автоматически для Битрикс24'");
		СвойствоОбъект.Наименование = НаименованиеСвойства;
		СвойствоОбъект.Заголовок 	= НаименованиеСвойства;
		СвойствоОбъект.ЗаголовокФормыВыбораЗначения = НаименованиеСвойства;
		СвойствоОбъект.ЗаголовокФормыЗначения 		= НаименованиеСвойства;
		
		лТип = Тип("СправочникСсылка.ЗначенияСвойствОбъектов");
		МассивТипов = Новый Массив;
		МассивТипов.Добавить(лТип);
		
		СвойствоОбъект.ЭтоДополнительноеСведение = Истина;
		СвойствоОбъект.ТипЗначения 	= Новый ОписаниеТипов(МассивТипов);
		СвойствоОбъект.Доступен 	= Ложь;
		СвойствоОбъект.Виден 		= Ложь;
		СвойствоОбъект.ДополнительныеЗначенияИспользуются 	= Истина;
		
		СвойствоОбъект.ДополнительныеСвойства.Вставить("ЗагрузкаСБитрикс24", Истина);
		СвойствоОбъект.Записать();
		СвойствоСсылка = СвойствоОбъект.Ссылка; 
		
	Иначе
		
		Выборка = ВыполненныйЗапрос.Выбрать();
		
		Пока Выборка.Следующий() Цикл
			СвойствоСсылка = Выборка.Ссылка; 
		КонецЦикла;
		
	КонецЕсли;
	
	Возврат СвойствоСсылка;
	
КонецФункции
   
Функция ПолучитьСтруктуруКлючейСмартПроцесса(НастройкаПодключения, ТипВладельцаСмартПроцесса) Экспорт
	
	СтруктураНастроек = Б24_СМ_ОбщегоНазначенияВызовСервера.СформироватьСтруктуруНастроек(НастройкаПодключения);
	
	КлючиСмартПроцесса = Новый Структура;
	КлючиСмартПроцесса.Вставить("КлючиШапки", Новый Соответствие);
	КлючиСмартПроцесса.Вставить("КлючиТЧ"	, Новый Соответствие);
	
	ПараметрыЗапроса 	= "&entityTypeId=" + ТипВладельцаСмартПроцесса;
	Метод 				= "/rest/crm.item.fields";	
	
	Результат = Б24_К_RestApiВызовСервера.ОтправкаДанныхНаПортал(СтруктураНастроек, Метод, ПараметрыЗапроса); 
	Если Результат <> Неопределено Тогда
		result = Результат.Получить("result");
		Если result <> Неопределено Тогда
			fields = result.Получить("fields");
			Если fields <> Неопределено Тогда
				Для каждого ТекЭлемент Из fields Цикл
					КлючиСмартПроцесса.КлючиШапки.Вставить(ТекЭлемент.Ключ, Новый Структура("Тип, Настройки", ТекЭлемент.Значение.Получить("type"), ТекЭлемент.Значение.Получить("settings")));
				КонецЦикла;
			КонецЕсли;                           
		КонецЕсли;                             
	КонецЕсли;
	
	ПараметрыЗапроса 	= "&entityTypeId=" + ТипВладельцаСмартПроцесса;
	Метод 				= "/rest/crm.item.productrow.fields";	
	
	Результат = Б24_К_RestApiВызовСервера.ОтправкаДанныхНаПортал(СтруктураНастроек, Метод, ПараметрыЗапроса); 
	Если Результат <> Неопределено Тогда
		result = Результат.Получить("result");
		Если result <> Неопределено Тогда
			fields = result.Получить("fields");
			Если fields <> Неопределено Тогда
				Для каждого ТекЭлемент Из fields Цикл
					КлючиСмартПроцесса.КлючиТЧ.Вставить(ТекЭлемент.Ключ, Новый Структура("Тип, Настройки", ТекЭлемент.Значение.Получить("type"), ТекЭлемент.Значение.Получить("settings")));
				КонецЦикла;
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	
	Возврат КлючиСмартПроцесса;
	
КонецФункции
